In [2]:
import pandas as pd 
df1 = pd.DataFrame ({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                     'group':['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame ({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                     'hire_date': [2004, 2008, 2011, 2009]})
print(df1); print('-'*20); print (df2)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
--------------------
  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2011
3      Sue       2009

In [12]:

df4 = pd.DataFrame({'group': ['Accounting', 'Engineering', 'HR'],
                    'supervisors': ['Carly', 'Guido', 'Steve']})
df5 = pd.DataFrame({'group': ['Accounting', 'Accounting', 'Engineering', 'Engineering', 'HR', 'HR'],
                    'skills': ['math', 'spreadsheets', 'coding', 'linux', 'spreadsheets', 'organization']})
print(df5); print('-'*20); print (df5)

         group        skills
0   Accounting          math
1   Accounting  spreadsheets
2  Engineering        coding
3  Engineering         linux
4           HR  spreadsheets
5           HR  organization
--------------------
         group        skills
0   Accounting          math
1   Accounting  spreadsheets
2  Engineering        coding
3  Engineering         linux
4           HR  spreadsheets
5           HR  organization

In [14]:
pd.merge(df4, df5)

         group supervisors        skills
0   Accounting       Carly          math
1   Accounting       Carly  spreadsheets
2  Engineering       Guido        coding
3  Engineering       Guido         linux
4           HR       Steve  spreadsheets
5           HR       Steve  organization

In [22]:
df3 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'salary': [70000, 80000, 120000, 90000]})
print(df1); print('-'*20); print (df3)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR
--------------------
   name  salary
0   Bob   70000
1  Jake   80000
2  Lisa  120000
3   Sue   90000

In [26]:
pd.merge(df1, df3, left_on = 'employee', right_on = 'name')

  employee        group  name  salary
0      Bob   Accounting   Bob   70000
1     Jake  Engineering  Jake   80000
2     Lisa  Engineering  Lisa  120000
3      Sue           HR   Sue   90000

In [30]:
pd.merge(df1, df3, left_on = 'employee', right_on = 'name').drop('name', axis = 1)

  employee        group  salary
0      Bob   Accounting   70000
1     Jake  Engineering   80000
2     Lisa  Engineering  120000
3      Sue           HR   90000

In [34]:
df1a = df1.set_index('employee') #setting the employee column as explicit index on df1
df2a = df2.set_index('employee') #setting the employee column as explicit index on df2
print(df1a); print('-'*20); print(df2a)

                group
employee
Bob        Accounting
Jake      Engineering
Lisa      Engineering
Sue                HR
--------------------
          hire_date
employee
Lisa           2004
Bob            2008
Jake           2011
Sue            2009

In [38]:
df1a.join(df2a) # join method performs merge defaults to joining indices

                group  hire_date
employee
Bob        Accounting       2008
Jake      Engineering       2011
Lisa      Engineering       2004
Sue                HR       2009

In [40]:
df5 = pd.DataFrame({'name': ['Peter', 'Paul', 'Mary'],
                    'food': ['fish', 'beans', 'bread']},
                   columns = ['name', 'food'])
                   
df6 = pd.DataFrame({'name': ['Mary', 'Joseph'],
                    'drink': ['wine', 'beer']},
                   columns = ['name', 'drink'])
print(df5); print('-'*20); print(df6)

    name   food
0  Peter   fish
1   Paul  beans
2   Mary  bread
--------------------
     name drink
0    Mary  wine
1  Joseph  beer

In [44]:
pd.merge(df5,df6)

   name   food drink
0  Mary  bread  wine

In [46]:
pd.merge(df5, df6, how ='inner') #intersection

   name   food drink
0  Mary  bread  wine

In [48]:
pd.merge(df5, df6, how ='outer')

     name   food drink
0  Joseph    NaN  beer
1    Mary  bread  wine
2    Paul  beans   NaN
3   Peter   fish   NaN

In [50]:
pd.merge(df5, df6, how ='left') #outputs left data

    name   food drink
0  Peter   fish   NaN
1   Paul  beans   NaN
2   Mary  bread  wine

In [52]:
pd.merge(df5, df6, how ='right')

     name   food drink
0    Mary  bread  wine
1  Joseph    NaN  beer

In [54]:
df7 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'rank': [1,2,3,4]})
df8 = pd.DataFrame({'name': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'rank': [3,1,4,2]})

print(df7), print('-'*20); print (df8)

   name  rank
0   Bob     1
1  Jake     2
2  Lisa     3
3   Sue     4
--------------------
   name  rank
0   Bob     3
1  Jake     1
2  Lisa     4
3   Sue     2

In [64]:
pd.merge(df7, df8) #confused to print

Empty DataFrame
Columns: [name, rank]
Index: []

In [62]:
pd.merge(df7, df8, on ='name')

   name  rank_x  rank_y
0   Bob       1       3
1  Jake       2       1
2  Lisa       3       4
3   Sue       4       2

In [66]:
pd.merge(df7, df8, on ='rank')

  name_x  rank name_y
0    Bob     1   Jake
1   Jake     2    Sue
2   Lisa     3    Bob
3    Sue     4   Lisa

In [68]:
pd.merge(df7, df8, on='name', suffixes=('_Left', '_Right'))

   name  rank_Left  rank_Right
0   Bob          1           3
1  Jake          2           1
2  Lisa          3           4
3   Sue          4           2